Repository: Choeng-Rayu/das-tern
Catalog: das_tern_mcp/lib/l10n/app_*.arb
Languages: km

# addNoteHint
source: Add a note...
km: បន្ថែមកំណត់ចំណាំ...

source: No notes yet
km: មិនទាន់មានកំណត់ចំណាំ

source: Edit Note
km: កែប្រែកំណត់ចំណាំ

source: Delete Note
km: លុបកំណត់ចំណាំ

# deleteNoteConfirmation
source: Are you sure you want to delete this note?
km: តើអ្នកពិតជាចង់លុបកំណត់ចំណាំនេះមែនទេ?

# noVitalReadings
source: No vital readings recorded
km: មិនទាន់មានការកត់ត្រាសញ្ញាសុខភាព

source: Latest Readings
km: ការកត់ត្រាថ្មីបំផុត

source: History ({count})
km: ប្រវត្តិ ({count})

source: Select Patient
km: ជ្រើសរើសអ្នកជំងឺ

source: Diagnosis
km: រោគវិនិច្ឆ័យ

source: Medicines
km: ថ្នាំ

# reviewStep
source: Review
km: ពិនិត្យឡើងវិញ

# noConnectedPatients
source: No connected patients found.
km: រកមិនឃើញអ្នកជំងឺដែលភ្ជាប់។

# symptomsLabel
source: Symptoms
km: រោគសញ្ញា

# symptomsRequired
source: Symptoms *
km: រោគសញ្ញា *

# diagnosisRequired
source: Diagnosis *
km: រោគវិនិច្ឆ័យ *

source: Clinical Note
km: កំណត់ចំណាំវេជ្ជសាស្ត្រ

# followUpLabel
source: Follow-up
km: ការពិនិត្យតាមដាន

source: Set follow-up date
km: កំណត់ថ្ងៃពិនិត្យតាមដាន

# followUpDateValue
source: Follow-up: {date}
km: ការពិនិត្យតាមដាន: {date}

source: Prescription created
km: បានបង្កើតវេជ្ជបញ្ជា

source: Prescription Details
km: ព័ត៌មានវេជ្ជបញ្ជា

source: Not found
km: រកមិនឃើញ

# licenseNumber
source: License #
km: លេខអាជ្ញាប័ណ្ណ

# versionLabel
source: Version
km: កំណែ

source: Timing
km: ពេលវេលា

# durationDays
source: Duration
km: រយៈពេល

# descriptionLabel
source: Description
km: ការពិពណ៌នា

# pauseButton
source: Pause
km: ផ្អាក

# resumeButton
source: Resume
km: បន្ត

# medicineNameRequired
source: Medicine Name *
km: ឈ្មោះថ្នាំ *

# medicineNameHintExample
source: e.g. Paracetamol
km: ឧ. Paracetamol

source: Medicine Name (Khmer)
km: ឈ្មោះថ្នាំ (ខ្មែរ)

# typeLabel
source: Type
km: ប្រភេទ

# frequencyRequired
source: Frequency *
km: ភាពញឹកញាប់ *

# frequencyHintExample
source: e.g. 2 times/day
km: ឧ. ២ ដងក្នុងមួយថ្ងៃ

# durationDaysLabel
source: Duration (days)
km: រយៈពេល (ថ្ងៃ)

source: Schedule
km: កាលវិភាគ

source: Additional Note
km: កំណត់ចំណាំបន្ថែម

source: Save Medicine
km: រក្សាទុកថ្នាំ

source: Required
km: ចាំបាច់

# connectFamilyTitle
source: Connect Family
km: ភ្ជាប់គ្រួសារ

# shareMedicationWithFamily
source: Share your medication information with family so they can help monitor
km: ចែករំលែកព័ត៌មានថ្នាំរបស់អ្នកជាមួយគ្រួសារ ដើម្បីឱ្យពួកគេអាចជួយត្រួតពិនិត្យ

source: Share QR Code
km: ចែករំលែកកូដ QR

# generateCodeForFamily
source: Generate code for family to scan
km: បង្កើតកូដដើម្បីឱ្យគ្រួសារស្កេន

source: Scan QR Code
km: ស្កេនកូដ QR

# scanCodeFromPatient
source: Scan code from patient to connect
km: ស្កេនកូដពីអ្នកជំងឺដើម្បីភ្ជាប់

source: Enter Code Manually
km: បញ្ចូលកូដដោយដៃ

# enterEightDigitConnectionCode
source: Enter 8-digit connection code
km: បញ្ចូលកូដតភ្ជាប់ ៨ ខ្ទង់

source: Code valid for 24 hours
km: កូដមានសុពលភាព ២៤ ម៉ោង

# enterCodeTitle
source: Enter Code
km: បញ្ចូលកូដ

source: Enter Connection Code
km: បញ្ចូលកូដតភ្ជាប់

# enterEightDigitFromPatient
source: Please enter the 8-digit code from the patient
km: សូមបញ្ចូលកូដ ៨ ខ្ទង់ពីអ្នកជំងឺ

# pleaseEnterCode
source: Please enter a code
km: សូមបញ្ចូលកូដ

source: Invalid code
km: កូដមិនត្រឹមត្រូវ

source: Paste from clipboard
km: បិទភ្ជាប់ពីក្ដារចម្លង

# scanQrInstead
source: Scan QR code instead
km: ស្កេនកូដ QR ជំនួស

# connectionCodeTitle
source: Connection Code
km: កូដតភ្ជាប់

source: Failed to generate token
km: បរាជ័យក្នុងការបង្កើតកូដ

# tokenExpired
source: Expired
km: ផុតកំណត់

# timeRemaining
source: {hours}h {minutes}m remaining
km: {hours}ម៉ {minutes}ន នៅសល់

source: Cannot generate code
km: មិនអាចបង្កើតកូដ

source: Or use code
km: ឬប្រើកូដ

# instructionStep1Family
source: Open app on family member's phone
km: បើកកម្មវិធីនៅលើទូរស័ព្ទគ្រួសារ

# instructionStep2Family
source: Tap "Scan QR Code" or "Enter Code"
km: ចុច "ស្កេនកូដ QR" ឬ "បញ្ចូលកូដ"

# instructionStep3Family
source: Scan this QR code or enter the code
km: ស្កេនកូដ QR នេះ ឬបញ្ចូលកូដ

# shareCodeButton
source: Share Code
km: ចែករំលែកកូដ

# shareCodeMessage
source: DasTern connection code: {token}
km: កូដតភ្ជាប់ DasTern: {token}

source: Generate New Code
km: បង្កើតកូដថ្មី

source: Code copied
km: កូដត្រូវបានចម្លង

# connectionTitle
source: Connection
km: ការតភ្ជាប់

source: Invalid token
km: កូដមិនត្រឹមត្រូវ

# tokenInvalidOrExpired
source: Token is invalid or expired
km: កូដមិនត្រឹមត្រូវ ឬផុតកំណត់

# connectionSuccess
source: Connection successful!
km: ការតភ្ជាប់បានជោគជ័យ!

source: Failed to connect
km: បរាជ័យក្នុងការតភ្ជាប់

# codeInvalid
source: Invalid Code
km: កូដមិនត្រឹមត្រូវ

# codeValidTitle
source: Code Valid!
km: កូដត្រឹមត្រូវ!

# connectionRequiresApproval
source: This connection will require patient approval
km: ការតភ្ជាប់នេះនឹងត្រូវការការយល់ព្រមពីអ្នកជំងឺ

# expiresLabel
source: Expires
km: ផុតកំណត់

# hoursUnit
source: hours
km: ម៉ោង

# minutesUnit
source: minutes
km: នាទី

source: Connection History
km: ប្រវត្តិការតភ្ជាប់

# filterAccepted
source: Accepted
km: បានទទួល

# filterRevoked
source: Revoked
km: បានដកហូត

# noHistoryFound
source: No history
km: មិនមានប្រវត្តិ

# connectionLabel
source: Connection
km: ការតភ្ជាប់

source: My Family
km: គ្រួសាររបស់ខ្ញុំ

# caregiversTab
source: Caregivers
km: អ្នកថែទាំ

# patientsTab
source: Patients
km: អ្នកជំងឺ

source: New Connection
km: ភ្ជាប់ថ្មី

source: No caregivers yet
km: មិនទាន់មានអ្នកថែទាំ

# shareQrToAllowFamily
source: Share QR code to allow family members to monitor medication adherence
km: ចែករំលែកកូដ QR ដើម្បីអនុញ្ញាតគ្រួសារ ត្រួតពិនិត្យការទទួលទានថ្នាំ

# notMonitoringPatients
source: Not monitoring any patients
km: មិនទាន់តាមដានអ្នកជំងឺ

# scanQrToStartMonitoring
source: Scan QR code from patient to start monitoring medication adherence
km: ស្កេនកូដ QR ពីអ្នកជំងឺដើម្បីចាប់ផ្តើម តាមដានការទទួលទានថ្នាំ

# caregiverLabel
source: Caregiver
km: អ្នកថែទាំ

# statusRevoked
source: Revoked
km: បានដកហូត

# accessLevelTitle
source: Access Level
km: កម្រិតការចូលប្រើ

source: Select Access Level
km: ជ្រើសរើសកម្រិតការចូលប្រើ

# accessLevelChangeableLater
source: You can change this level later
km: អ្នកអាចផ្លាស់ប្តូរកម្រិតនេះនៅពេលក្រោយ

source: View Only
km: មើលប៉ុណ្ណោះ

# viewOnlyDescription
source: Caregiver can only view medication schedules
km: គ្រួសារអាចមើលតារាងថ្នាំប៉ុណ្ណោះ

# viewAndRemind
source: View + Remind
km: មើល + រំលឹក

# viewAndRemindDescription
source: Caregiver can view and send nudge reminders
km: គ្រួសារអាចមើលនិងផ្ញើការរំលឹក

# viewAndManage
source: View + Manage
km: មើល + គ្រប់គ្រង

# viewAndManageDescription
source: Caregiver can view, remind and edit schedules
km: គ្រួសារអាចមើល រំលឹក និងកែប្រែតារាង

source: Connection not found
km: រកមិនឃើញការតភ្ជាប់

source: Disconnect Connection
km: ផ្តាច់ការតភ្ជាប់

# todayMedicationSchedule
source: Today's Medication Schedule
km: តារាងថ្នាំថ្ងៃនេះ

source: No medication data
km: មិនមានទិន្នន័យថ្នាំ

# connectionConnected
source: Connected
km: តភ្ជាប់រួចរាល់

# missedDosesSection
source: Missed Doses
km: ថ្នាំខកខាន

source: No missed doses
km: មិនមានថ្នាំខកខាន

source: Send Nudge
km: ផ្ញើការរំលឹក

# nudgeRemindPatient
source: Remind patient to take medication
km: រំលឹកអ្នកជំងឺពីការទទួលទានថ្នាំ

# nudgeSentSuccess
source: Nudge sent successfully
km: ការរំលឹកត្រូវបានផ្ញើ

# nudgeSentFailed
source: Failed to send nudge
km: មិនអាចផ្ញើការរំលឹក

# disconnectDialogTitle
source: Disconnect?
km: ផ្តាច់ការតភ្ជាប់?

# disconnectDialogContent
source: You will no longer be able to view this patient's medication information.
km: អ្នកនឹងមិនអាចមើលព័ត៌មានថ្នាំរបស់អ្នកជំងឺនេះទៀតទេ។

# disconnectButton
source: Disconnect
km: ផ្តាច់

# gracePeriodTitle
source: Grace Period
km: ពេលវេលាផុតកំណត់

# gracePeriodLabel
source: Grace Period
km: ពេលវេលាអនុគ្រោះ

# gracePeriodDescription
source: Wait time before notifying family of missed medication
km: ពេលវេលារង់ចាំមុនពេលជូនដំណឹងគ្រួសារ ពីថ្នាំដែលខកខាន

# gracePeriod10Min
source: 10 minutes
km: ១០ នាទី

# notifyImmediatelyAfterMiss
source: Notify immediately after missed dose
km: ជូនដំណឹងភ្លាមបន្ទាប់ពីខកខាន

# gracePeriod20Min
source: 20 minutes
km: ២០ នាទី

# allowSomeDelay
source: Allow some time for delay
km: ផ្តល់ពេលបន្តិចសម្រាប់ការពន្យឺត

# gracePeriod30Min
source: 30 minutes
km: ៣០ នាទី

# defaultRecommended
source: Default setting (Recommended)
km: ការកំណត់ដើម (ណែនាំ)

# gracePeriod1Hour
source: 1 hour
km: ១ ម៉ោង

source: Allow additional time
km: ផ្តល់ពេលវេលាបន្ថែម

source: Settings saved
km: បានរក្សាទុកការកំណត់

source: Failed to save
km: បរាជ័យក្នុងការរក្សាទុក

# recommendedBadge
source: Recommended
km: ណែនាំ

# scanQrTitle
source: Scan QR Code
km: ស្កេនកូដ QR

# positionQrInFrame
source: Position QR code in the frame
km: ដាក់កូដ QR នៅក្នុងប្រអប់

# qrWillScanAutomatically
source: QR code will be scanned automatically
km: កូដ QR នឹងត្រូវស្កេនដោយស្វ័យប្រវត្តិ

source: Search country...
km: ស្វែងរកប្រទេស...

source: Select Country
km: ជ្រើសរើសប្រទេស

# phoneExample
source: e.g. {example}
km: ឧ. {example}
