Repository: Choeng-Rayu/das-tern
Catalog: das_tern_mcp/lib/l10n/app_*.arb
Languages: km

# appTagline
source: Medication Companion
km: ដៃគូរំលឹកការប្រើប្រាស់ថ្នាំ

source: Sign In
km: ចូលគណនី

source: Sign in with Google
km: ចូលតាមរយៈ Google

# orDivider
source: or
km: ឬ

source: Forgot password?
km: ភ្លេចលេខកូដសម្ងាត់?

# dontHaveAccount
source: Don't have an account?
km: មិនមានគណនី?

# alreadyHaveAccount
source: Already have an account?
km: មានគណនីរួចហើយ?

source: Create Account
km: បង្កើតគណនី

source: Create New Account
km: បង្កើតគណនីថ្មី

source: Login
km: ចូលគណនី

source: Register
km: ចុះឈ្មោះ

# welcomeMessage
source: Your medication reminder companion
km: ដៃគូរំលឹកការប្រើប្រាស់ថ្នាំរបស់អ្នក

# selectRoleTitle
source: I am...
km: ខ្ញុំជា...

# selectRoleSubtitle
source: Select your role to get started
km: ជ្រើសរើសតួនាទីរបស់អ្នកដើម្បីចាប់ផ្តើម

# patientRole
source: Patient
km: អ្នកជំងឺ

# patientRoleDescription
source: Track medication, set reminders, and manage prescriptions.
km: តាមដានថ្នាំ កំណត់ការរំលឹក និងគ្រប់គ្រងវេជ្ជបញ្ជា។

# doctorRole
source: Doctor
km: វេជ្ជបណ្ឌិត

# doctorRoleDescription
source: Manage patients, create prescriptions, and monitor medication intake.
km: គ្រប់គ្រងអ្នកជំងឺ បង្កើតវេជ្ជបញ្ជា និងតាមដានការទទួលទានថ្នាំ។

# doctorRegistrationTitle
source: Doctor Registration
km: ចុះឈ្មោះវេជ្ជបណ្ឌិត

# doctorRegistrationSubtitle
source: Fill in your information to create a doctor account
km: បំពេញព័ត៌មានដើម្បីបង្កើតគណនីវេជ្ជបណ្ឌិត

# personalInfoSection
source: Personal Information
km: ព័ត៌មានផ្ទាល់ខ្លួន

# professionalInfoSection
source: Professional Information
km: ព័ត៌មានវិជ្ជាជីវៈ

# accountSecuritySection
source: Account Security
km: សុវត្ថិភាពគណនី

# accountVerificationInfo
source: Your account will be verified by our team.
km: គណនីរបស់អ្នកនឹងត្រូវបានផ្ទៀងផ្ទាត់ដោយក្រុមការងាររបស់យើង។

# step1PersonalInfo
source: Step 1 of 2 - Personal Information
km: ជំហានទី ១ នៃ ២ - ព័ត៌មានផ្ទាល់ខ្លួន

# step2AccountInfo
source: Step 2 of 2 - Account Information
km: ជំហានទី ២ នៃ ២ - ព័ត៌មានគណនី

source: Last Name
km: នាមត្រកូល

# fillLastNameHint
source: Enter your last name
km: សូមបំពេញនាមត្រកូលរបស់អ្នក

# fillLastNameError
source: Please enter your last name
km: សូមបំពេញនាមត្រកូល

source: First Name
km: នាមខ្លួន

# fillFirstNameHint
source: Enter your first name
km: សូមបំពេញនាមខ្លួនរបស់អ្នក

# fillFirstNameError
source: Please enter your first name
km: សូមបំពេញនាមខ្លួន

source: Gender
km: ភេទ

# genderMale
source: Male
km: ប្រុស

# genderFemale
source: Female
km: ស្រី

# genderOther
source: Other
km: ផ្សេងៗ

source: Date of Birth
km: ថ្ងៃ ខែ ឆ្នាំ កំណើត

source: Please select date of birth
km: សូមជ្រើសរើសថ្ងៃខែឆ្នាំកំណើត

source: ID Card Number
km: លេខអត្តសញ្ញាណប័ណ្ណ

# idCardNumberHint
source: Enter your ID card number
km: សូមបំពេញលេខអត្តសញ្ញាណប័ណ្ណរបស់អ្នក

# idCardNumberError
source: Please enter your ID card number
km: សូមបំពេញលេខអត្តសញ្ញាណប័ណ្ណ

# idCardOptional
source: (Optional)
km: (ស្រេចចិត្ត)

source: Phone Number
km: លេខទូរស័ព្ទ

# phoneNumberHint
source: Enter your phone number
km: សូមបំពេញលេខទូរស័ព្ទរបស់អ្នក

# phoneNumberEmpty
source: Please enter phone number
km: សូមបំពេញលេខទូរស័ព្ទ

# phoneNumberInvalid
source: Invalid phone number
km: លេខទូរស័ព្ទមិនត្រឹមត្រូវ

source: Full Name
km: ឈ្មោះពេញ

# fullNameHint
source: Enter your full name
km: សូមបំពេញឈ្មោះពេញរបស់អ្នក

# fullNameError
source: Please enter full name
km: សូមបំពេញឈ្មោះពេញ

source: Hospital / Clinic
km: មន្ទីរពេទ្យ / គ្លីនិក

# hospitalClinicHint
source: Enter your hospital or clinic
km: សូមបំពេញមន្ទីរពេទ្យ ឬ គ្លីនិក

# hospitalClinicError
source: Please enter hospital
km: សូមបំពេញមន្ទីរពេទ្យ

source: Specialty
km: ឯកទេស

# specialtyHint
source: e.g. General Medicine, Cardiology
km: ឧ. វេជ្ជសាស្ត្រទូទៅ, បេះដូង

# specialtyError
source: Please enter specialty
km: សូមបំពេញឯកទេស

# medicalLicense
source: Medical License Number
km: លេខអាជ្ញាប័ណ្ណវេជ្ជសាស្ត្រ

# medicalLicenseHint
source: Enter your license number
km: សូមបំពេញលេខអាជ្ញាប័ណ្ណ

# medicalLicenseError
source: Please enter license number
km: សូមបំពេញលេខអាជ្ញាប័ណ្ណ

source: Password
km: លេខកូដសម្ងាត់

# passwordHint
source: Enter your password
km: សូមបំពេញលេខកូដសម្ងាត់របស់អ្នក

# passwordEmpty
source: Please enter password
km: សូមបំពេញលេខកូដសម្ងាត់

# passwordTooShort
source: At least 6 characters required
km: យ៉ាងហោចណាស់ ៦ តួអក្សរ

source: Confirm Password
km: បញ្ជាក់លេខកូដសម្ងាត់

# confirmPasswordHint
source: Enter your password again
km: សូមបំពេញលេខកូដសម្ងាត់របស់អ្នកម្ដងទៀត

# passwordMismatch
source: Passwords do not match
km: លេខកូដសម្ងាត់មិនត្រូវគ្នា

# continueButton
source: Continue
km: បន្ត

# termsNotice
source: Please read the terms and conditions before using the app
km: សូមអានលក្ខន្ដិកៈ និងច្បាប់មុនពេលប្រើប្រាស់កម្មវិធី

# termsRead
source: Already read
km: អានរួចរាល់

# verifyCodeTitle
source: Verify Code
km: បញ្ជាក់លេខកូដ

# otpSentMessage
source: We sent a 4-digit code to
km: យើងបានផ្ញើលេខកូដ ៤ ខ្ទង់ទៅ

# otpFillError
source: Please enter the 4-digit code
km: សូមបំពេញលេខកូដ ៤ ខ្ទង់

# verifyButton
source: Verify
km: បញ្ជាក់

# resendCodeIn
source: Resend code in {seconds}s
km: ផ្ញើលេខកូដម្ដងទៀតក្នុង {seconds}វ

source: Resend Code
km: ផ្ញើលេខកូដម្ដងទៀត

source: Hello
km: សួស្តី

source: Welcome Back
km: សូមស្វាគមន៍ត្រលប់មកវិញ

# welcomeTitle
source: Welcome to DasTern
km: សូមស្វាគមន៍មកកាន់ DasTern

source: Get Started
km: ចាប់ផ្តើម

source: Home
km: ទំព័រដើម

source: Dashboard
km: ផ្ទាំងគ្រប់គ្រង

source: Medications
km: ថ្នាំ

source: Analysis
km: ការវិភាគ

source: Scan
km: ស្កេន

source: Family
km: គ្រួសារ

source: Profile
km: ប្រវត្តិរូប

source: Settings
km: ការកំណត់

# todaySchedule
source: Today's Schedule
km: កាលវិភាគថ្ងៃនេះ

# todayMedications
source: Today's Medications
km: ថ្នាំថ្ងៃនេះ

# todayReminders
source: Today's Reminders
km: ការរំលឹកថ្ងៃនេះ

source: Quick Stats
km: ស្ថិតិរហ័ស

source: Quick Actions
km: សកម្មភាពរហ័ស

# noRemindersToday
source: No reminders for today
km: គ្មានការរំលឹកសម្រាប់ថ្ងៃនេះ

source: Medicine List
km: បញ្ជីថ្នាំ

source: Medicine Name
km: ឈ្មោះថ្នាំ

source: Add Medicine
km: បន្ថែមថ្នាំ

source: Edit Medicine
km: កែប្រែថ្នាំ

# noMedicines
source: No medicines added yet
km: មិនទាន់មានថ្នាំនៅឡើយទេ

source: Medication Name
km: ឈ្មោះថ្នាំ

source: Add Medication
km: បន្ថែមថ្នាំ

source: Edit Medication
km: កែប្រែថ្នាំ

source: Delete Medication
km: លុបថ្នាំ

# deleteMedicationMessage
source: Are you sure you want to delete this medication?
km: តើអ្នកពិតជាចង់លុបថ្នាំនេះមែនទេ?

source: Create Medication
km: បង្កើតថ្នាំ

# noMedications
source: No medications added yet
km: មិនទាន់មានថ្នាំនៅឡើយទេ

# medicationDeleted
source: Medication deleted successfully
km: បានលុបថ្នាំជោគជ័យ

# medicationAdded
source: Medication added successfully
km: បានបន្ថែមថ្នាំជោគជ័យ

# medicationUpdated
source: Medication updated successfully
km: បានកែប្រែថ្នាំជោគជ័យ

# medicationCreated
source: Medication created successfully
km: បង្កើតថ្នាំបានជោគជ័យ

source: Dosage
km: កម្រិតប្រើប្រាស់

source: Dosage Amount
km: ចំនួនប្រើ

source: Amount
km: ចំនួន

source: Unit
km: ឯកតា

source: Form
km: ទម្រង់

source: Frequency
km: ភាពញឹកញាប់

source: dose
km: ដុំ

source: times per day
km: ដងក្នុងមួយថ្ងៃ

source: Tablet
km: គ្រាប់

source: Capsule
km: កាប់ស៊ុល

source: Liquid
km: ទឹក

source: ml
km: មីលីលីត្រ

source: mg
km: មីលីក្រាម

source: Other
km: ផ្សេងទៀត

source: Regular
km: ធម្មតា

# prn
source: As Needed (PRN)
km: តាមតម្រូវការ

source: Instruction
km: របៀបប្រើប្រាស់

source: Instructions
km: សេចក្តីណែនាំ

source: Prescribed By
km: ចេញវេជ្ជបញ្ជាដោយ

source: Enter medication name
km: បញ្ចូលឈ្មោះថ្នាំ

source: Enter amount
km: បញ្ចូលចំនួន

# enterInstruction
source: Enter usage instructions
km: បញ្ចូលរបៀបប្រើប្រាស់

# enterPrescriber
source: Enter prescriber name
km: បញ្ចូលឈ្មោះវេជ្ជបណ្ឌិត

# fieldRequired
source: This field is required
km: ចាំបាច់បំពេញ

source: Reminders
km: ការរំលឹក

source: Reminder
km: ការរំលឹក

source: Reminder Time
km: ពេលវេលារំលឹក

source: Manage Reminders
km: គ្រប់គ្រងការរំលឹក

source: Edit Reminder
km: កែប្រែការរំលឹក

source: Delete Reminder
km: លុបការរំលឹក

# autoGenerateReminders
source: Auto-generate 3 daily reminders
km: បង្កើតការរំលឹក ៣ ដងក្នុងមួយថ្ងៃដោយស្វ័យប្រវត្តិ

# remindersGenerated
source: Reminders generated successfully
km: បានបង្កើតការរំលឹកជោគជ័យ

# reminderSet
source: Reminder set successfully
km: កំណត់ការរំលឹកបានជោគជ័យ

source: Add Time
km: បន្ថែមពេលវេលា

# noRemindersAdded
source: No reminder times added yet. Tap 'Add Time' to set medication schedule.
km: មិនទាន់បានបន្ថែមពេលវេលារំលឹកនៅឡើយទេ។ ចុច 'បន្ថែមពេលវេលា' ដើម្បីកំណត់កាលវិភាគថ្នាំ។

# addAtLeastOneReminder
source: Please add at least one reminder time
km: សូមបន្ថែមពេលវេលារំលឹកយ៉ាងហោចណាស់មួយ

source: Morning
km: ពេលព្រឹក

source: Afternoon
km: ពេលរសៀល

source: Evening
km: ពេលល្ងាច

source: Night
km: ពេលយប់

source: Daytime
km: ពេលថ្ងៃ

source: Time of Day
km: ពេលវេលាក្នុងថ្ងៃ

source: Time
km: ពេលវេលា

source: Days
km: ថ្ងៃ

source: Active Days
km: ថ្ងៃសកម្ម

source: Mark as Taken
km: សម្គាល់ថាបានទទួលទាន

source: Marked as taken
km: សម្គាល់ថាបានទទួលទាន

source: Taken
km: បានញ៉ាំ

source: Taken at
km: បានញ៉ាំនៅ

source: Skip
km: រំលង

source: Skipped
km: បានរំលង

source: Missed
km: ខកខាន

source: Delayed
km: យឺត

source: Active
km: សកម្ម

source: Inactive
km: អសកម្ម

source: Pending
km: រងចាំ

source: Completed
km: បានបញ្ចប់

source: Scheduled for
km: កំណត់ពេលសម្រាប់

# upcomingReminders
source: Upcoming
km: នៅសល់

# completedReminders
source: Completed
km: បានបញ្ចប់

source: History
km: ប្រវត្តិ

source: Intake History
km: ប្រវត្តិការប្រើថ្នាំ

source: Adherence Rate
km: អត្រាប្រើប្រាស់ត្រឹមត្រូវ

source: View History
km: មើលប្រវត្តិ

source: No history yet
km: មិនទាន់មានប្រវត្តិទេ

source: This Week
km: សប្តាហ៍នេះ

source: This Month
km: ខែនេះ

source: All
km: ទាំងអស់

source: View All
km: មើលទាំងអស់

source: Patient
km: អ្នកជំងឺ

source: Login as Doctor
km: ចូលប្រើប្រាស់ជាគ្រូពេទ្យ

source: Select date of birth
km: ជ្រើសរើសថ្ងៃខែឆ្នាំកំណើត

source: Blood Type
km: ក្រុមឈាម

source: Family Contact
km: លេខទូរស័ព្ទគ្រួសារ

# weight
source: Weight (kg)
km: ទម្ងន់ (kg)

# address
source: Address (Optional)
km: អាសយដ្ឋាន (ស្រេចចិត្ត)

source: Please enter name
km: សូមបញ្ចូលឈ្មោះ

# pleaseEnterPhone
source: Please enter phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទ

source: Please enter password
km: សូមបញ្ចូលលេខសម្ងាត់

source: Please select blood type
km: សូមជ្រើសរើសក្រុមឈាម

source: Please enter family contact
km: សូមបញ្ចូលលេខទូរស័ព្ទគ្រួសារ

# loginError
source: Invalid phone number or password
km: លេខទូរស័ព្ទ ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ

# registerSuccess
source: Registration successful!
km: ចុះឈ្មោះបានជោគជ័យ!

# enterNameHint
source: Kimhour
km: សុខជាត

# enterAddressHint
source: Street, District, Province
km: ភូមិ កុម សង្កាត់

source: Language
km: ភាសា

source: Select Language
km: ជ្រើសរើសភាសា

source: English
km: អង់គ្លេស

source: Khmer
km: ខ្មែរ

source: Theme
km: ស្បែក

source: Select Theme
km: ជ្រើសរើសស្បែក

source: Light Mode
km: ស្បែកភ្លឺ

source: Dark Mode
km: ស្បែកងងឹត

# lightTheme
source: Light
km: ភ្លឺ

# darkTheme
source: Dark
km: ងងឹត

# systemTheme
source: System
km: ប្រព័ន្ធ

source: Notifications
km: ការជូនដំណឹង

source: Security
km: សុវត្ថិភាព

source: About
km: អំពី

source: Logout
km: ចាកចេញ

# logoutConfirmation
source: Are you sure you want to logout?
km: តើអ្នកពិតជាចង់ចាកចេញមែនទេ?

source: Save
km: រក្សាទុក

source: Cancel
km: បោះបង់

source: Delete
km: លុប

source: Edit
km: កែប្រែ

source: Confirm
km: បញ្ជាក់

source: OK
km: យល់ព្រម

source: Error
km: កំហុស

source: Success
km: ជោគជ័យ

source: Loading...
km: កំពុងផ្ទុក...

source: Retry
km: ព្យាយាមម្ដងទៀត

source: No data
km: គ្មានទិន្នន័យ

source: Coming Soon
km: នឹងមកដល់ឆាប់ៗ

source: Done
km: រួចរាល់

# homeTab
source: Home
km: ទំព័រដើម

# medicationsAnalysis
source: Medications
km: ការវិភាគថ្នាំ

# scanPrescriptionTab
source: Scan
km: ស្កេន

# familyFeatures
source: Family
km: គ្រួសារ

# greetingName
source: Hello {name}!
km: សួស្តី {name}!

# defaultPatientName
source: Patient
km: អ្នកជំងឺ

source: Medication Tracker
km: និម្មិតពន្ទុថ្នាំ

source: Before meal
km: មុនបាយ

# medicineCountLabel
source: {count} medicine(s)
km: ថ្នាំចំនួន {count} មុខ

# progressMessage
source: Medicine intake progress
km: អ្នកបានទទួលបន្ទុកបញ្ចូលថ្នាំ

# dayProgress
source: Day {days} completed
km: ថ្ងៃទី {days} ថ្ងៃហើយ

# totalDuration
source: Total medication period 30 days
km: រយពេលការទទួលថ្នាំសរុប ៣០ ថ្ងៃ

# todaysTasks
source: Tasks (Today)
km: ការអំពើក (ថ្ងៃនេះ)

source: All completed!
km: រួចរាល់ទាំងអស់!

# noMoreMedicationsToday
source: No more medications for today
km: គ្មានថ្នាំបន្ថែមសម្រាប់ថ្ងៃនេះ

# searchPrescription
source: Search prescriptions
km: ស្វែងរកថ្នាំបញ្ជា

source: Medication intake history
km: សកម្មភាពពេល ទទួលថ្នាំ

source: Health Vitals
km: សុខភាពសារជាតិ

source: Thresholds
km: កំណត់កម្រិត

# emergencyLabel
source: Emergency
km: ពេលបន្ទាន់

# recordLabel
source: Record
km: កត់ត្រា

# onePill
source: 1 pill
km: ១ គ្រាប់

# unresolvedAlerts
source: {count} unresolved health alert(s)
km: ការជូនដំណឹងសុខភាព {count} មិនទាន់ដោះស្រាយ

# daysUnit
source: days
km: ថ្ងៃ

source: No active prescriptions
km: គ្មានវេជ្ជបញ្ជាសកម្មទេ

# prescriptionsAppearHere
source: Your prescriptions will appear here once added by your doctor.
km: វេជ្ជបញ្ជារបស់អ្នកនឹងបង្ហាញនៅទីនេះ បន្ទាប់ពីត្រូវបានបន្ថែមដោយវេជ្ជបណ្ឌិត។

# medicationCountLabel
source: {count} medication(s)
km: ថ្នាំ {count} មុខ

source: Change Password
km: ប្តូរលេខសម្ងាត់

# oldPasswordHint
source: Enter old password
km: បំពេញលេខសម្ងាត់ចាស់

# newPasswordHint
source: Enter new password
km: បំពេញលេខសម្ងាត់ថ្មី

source: Password change coming soon
km: មុខងារប្តូរលេខសម្ងាត់នឹងមកដល់ឆាប់ៗ

source: Preferences
km: ចំណូលចិត្ត

source: Account
km: គណនី

source: Edit Profile
km: កែប្រែប្រវត្តិរូប

source: My Caregivers
km: អ្នកថែទាំរបស់ខ្ញុំ

source: Patients I monitor
km: អ្នកជំងឺដែលខ្ញុំតាមដាន

source: No connections
km: មិនមានការភ្ជាប់

# connectWithFamily
source: Connect with family to monitor medication intake
km: ភ្ជាប់ជាមួយគ្រួសារដើម្បី ត្រួតពិនិត្យការទទួលទានថ្នាំ

source: Connect Now
km: ភ្ជាប់ពេលនេះ

source: View All Connections
km: មើលការតភ្ជាប់ទាំងអស់

# activeStatus
source: Active
km: សកម្ម

# waitingStatus
source: Waiting
km: រង់ចាំ

source: Grace Period Settings
km: ការកំណត់ពេលវេលា

source: Unknown
km: មិនស្គាល់

# scanPrescriptionTitle
source: Scan Prescription
km: ស្កេនវេជ្ជបញ្ជា

# scanPrescriptionDescription
source: Use your camera to scan a prescription from your doctor.
km: ប្រើកាមេរ៉ារបស់អ្នកដើម្បីស្កេនវេជ្ជបញ្ជា ពីវេជ្ជបណ្ឌិតរបស់អ្នក។

source: Open Scanner
km: បើកស្កេនន័រ

# scannerComingSoon
source: Scanner feature coming soon
km: មុខងារស្កេនន័រនឹងមកដល់ឆាប់ៗ

# doseHistoryAppearHere
source: Your dose history will appear here.
km: ប្រវត្តិការប្រើថ្នាំរបស់អ្នកនឹងបង្ហាញនៅទីនេះ។

source: No notifications
km: គ្មានការជូនដំណឹង

source: All features unlocked
km: មុខងារទាំងអស់ត្រូវបានបើក

# upgradeToUnlock
source: Upgrade to unlock all features
km: ដំឡើងដើម្បីបើកមុខងារទាំងអស់

source: Upgrade
km: ដំឡើង

source: My Connections
km: ការតភ្ជាប់របស់ខ្ញុំ

source: Log Out
km: ចាកចេញ

source: Payment Method
km: វិធីទូទាត់

source: Select Payment Method
km: ជ្រើសរើសវិធីទូទាត់

source: Order Summary
km: សេចក្តីសង្ខេបការបញ្ជាទិញ

# planNamePlan
source: {name} Plan
km: គម្រោង {name}

# pricePerMonth
source: ${price}/month
km: ${price}/ខែ

source: Bakong (KHQR)
km: បាគង (KHQR)

# payWithCambodiaBank
source: Pay with any Cambodian banking app
km: បង់ប្រាក់តាមរយៈកម្មវិធីធនាគារកម្ពុជា

# scanQRWithBank
source: Scan QR code with ABA, ACLEDA, Wing, or any KHQR-supported bank
km: ស្កេន QR code ជាមួយ ABA, ACLEDA, Wing ឬធនាគារដែលគាំទ្រ KHQR

# internationalCard
source: International credit or debit card
km: កាតឥណទាន ឬកាតឥណពន្ធអន្តរជាតិ

# internationalCardSupport
source: Support for Visa, Mastercard, and other international cards
km: គាំទ្រ Visa, Mastercard និងកាតអន្តរជាតិផ្សេងទៀត

# bakongPaymentTitle
source: Bakong Payment
km: ការទូទាត់បាគង

source: Bakong KHQR Payment
km: ការទូទាត់បាគង KHQR

source: National Bank of Cambodia
km: ធនាគារជាតិនៃកម្ពុជា

source: Plan Summary
km: សេចក្តីសង្ខេបគម្រោង

source: Plan
km: គម្រោង

source: Price
km: តម្លៃ

# billingLabel
source: Billing
km: វិក្កយបត្រ

# monthlyBilling
source: Monthly
km: ប្រចាំខែ

# paymentLabel
source: Payment
km: ការទូទាត់

source: How it Works
km: របៀបប្រើប្រាស់

# bakongStep1
source: Click "Confirm & Get QR Code" below
km: ចុច "បញ្ជាក់ និងទទួល QR Code" ខាងក្រោម

# bakongStep2
source: Open your banking app (ABA, ACLEDA, Wing, etc.)
km: បើកកម្មវិធីធនាគារ (ABA, ACLEDA, Wing, etc.)

# bakongStep3
source: Scan the QR code displayed on screen
km: ស្កេន QR code នៅលើអេក្រង់

# bakongStep4
source: Confirm payment in your banking app
km: បញ្ជាក់ការទូទាត់ក្នុងកម្មវិធីធនាគារ

# bakongStep5
source: Your plan will be upgraded automatically
km: គម្រោងរបស់អ្នកនឹងត្រូវបានដំឡើងដោយស្វ័យប្រវត្តិ

# paymentSecureNotice
source: Your payment is processed securely through the Bakong system by the National Bank of Cambodia.
km: ការទូទាត់របស់អ្នកត្រូវបានដំណើរការដោយសុវត្ថិភាពតាមរយៈប្រព័ន្ធបាគងដោយធនាគារជាតិនៃកម្ពុជា។

# confirmAndGetQR
source: Confirm & Get QR Code
km: បញ្ជាក់ និងទទួល QR Code

source: Scan to Pay
km: ស្កេនដើម្បីបង់ប្រាក់

source: Payment Successful!
km: ការទូទាត់បានជោគជ័យ!

source: Payment Failed
km: ការទូទាត់បានបរាជ័យ

source: Payment Expired
km: ការទូទាត់បានផុតកំណត់

source: Waiting for Payment
km: កំពុងរង់ចាំការទូទាត់

# waitingForPaymentEllipsis
source: Waiting for payment...
km: កំពុងរង់ចាំការទូទាត់...

source: Try Again
km: សាកម្ដងទៀត

source: How to Pay
km: របៀបបង់ប្រាក់

# howToPayStep1
source: 1. Open your banking app
km: ១. បើកកម្មវិធីធនាគាររបស់អ្នក

# howToPayStep2
source: 2. Select "Scan QR" or "KHQR"
km: ២. ជ្រើសរើស "ស្កេន QR" ឬ "KHQR"

# howToPayStep3
source: 3. Scan the QR code above
km: ៣. ស្កេន QR code ខាងលើ

# howToPayStep4
source: 4. Confirm the amount and pay
km: ៤. បញ្ជាក់ចំនួនទឹកប្រាក់ និងបង់

# howToPayStep5
source: 5. Payment will be verified automatically
km: ៥. ការទូទាត់នឹងត្រូវបានផ្ទៀងផ្ទាត់ដោយស្វ័យប្រវត្តិ

# supportedByAllKHQR
source: Supported by all KHQR banks
km: គាំទ្រដោយធនាគារ KHQR ទាំងអស់

source: Cancel Payment?
km: បោះបង់ការទូទាត់?

# cancelPaymentMessage
source: Are you sure you want to cancel? Your payment will not be processed.
km: តើអ្នកពិតជាចង់បោះបង់មែនទេ? ការទូទាត់នឹងមិនត្រូវបានដំណើរការ។

source: Keep Waiting
km: រង់ចាំបន្ត

# subscriptionUpgraded
source: Your subscription has been upgraded
km: ការជាវរបស់អ្នកត្រូវបានដំឡើង

# allPremiumFeaturesUnlocked
source: All premium features are now unlocked
km: មុខងារ Premium ទាំងអស់ត្រូវបានបើក

# unlimitedPrescriptions
source: ∞ Prescriptions
km: វេជ្ជបញ្ជាគ្មានដែនកំណត់

# storageAmount
source: 20 GB
km: ២០ GB

# priorityLabel
source: Priority
km: អាទិភាព

source: Go to Home
km: ទៅទំព័រដើម

source: Upgrade Plan
km: ដំឡើងគម្រោង

# choosePlan
source: Choose a Plan
km: ជ្រើសរើសគម្រោង

source: Current Plan
km: គម្រោងបច្ចុប្បន្ន

# currentLabel
source: Current
km: បច្ចុប្បន្ន

source: Upgrade Now
km: ដំឡើងឥឡូវ

source: Feature Comparison
km: ការប្រៀបធៀបមុខងារ

# prescriptionsFeature
source: Prescriptions
km: វេជ្ជបញ្ជា

# medicinesFeature
source: Medicines
km: ថ្នាំ

# familyLinksFeature
source: Family Links
km: តំណគ្រួសារ

# storageFeature
source: Storage
km: ទំហំផ្ទុក

# prioritySupportFeature
source: Priority Support
km: ការគាំទ្រអាទិភាព

# familyPlanFeature
source: Family Plan
km: គម្រោងគ្រួសារ

source: Add at least one medicine
km: សូមបន្ថែមថ្នាំយ៉ាងហោចណាស់មួយមុខ

source: Self-prescribed
km: ជ្រើសរើសដោយខ្លួនឯង

source: Medicine added successfully
km: បានបន្ថែមថ្នាំជោគជ័យ

source: Label / Purpose
km: ស្លាក / គោលបំណង

# labelPurposeHint
source: e.g. Daily vitamins
km: ឧ. វីតាមីនប្រចាំថ្ងៃ

source: Added Medicines
km: ថ្នាំដែលបានបន្ថែម

# saveWithCount
source: Save ({count} medicine(s))
km: រក្សាទុក ({count} មុខ)

source: Record Vital
km: កត់ត្រាសុខភាព

source: Select Vital Type
km: ជ្រើសរើសប្រភេទសុខភាព

source: Enter value
km: បញ្ចូលតម្លៃ

source: Measured at
km: វាស់នៅ

source: Notes (optional)
km: កំណត់ចំណាំ (ស្រេចចិត្ត)

# vitalRecordedSuccess
source: Vital recorded successfully
km: បានកត់ត្រាសុខភាពជោគជ័យ

source: Failed to record vital
km: បរាជ័យក្នុងការកត់ត្រាសុខភាព

source: No data available
km: គ្មានទិន្នន័យ

# daysCount
source: {count} days
km: {count} ថ្ងៃ

source: Alert Thresholds
km: កម្រិតការជូនដំណឹង

source: Using defaults
km: ប្រើតម្លៃដើម

# minLabel
source: Min ({unit})
km: អប្បបរមា ({unit})

# maxLabel
source: Max ({unit})
km: អតិបរមា ({unit})

source: Min Diastolic
km: Diastolic អប្បបរមា

source: Max Diastolic
km: Diastolic អតិបរមា

source: Confirm Emergency
km: បញ្ជាក់ពេលបន្ទាន់

# confirmEmergencyMessage
source: This will send an emergency alert to all your connected caregivers and doctors. Are you sure?
km: នេះនឹងផ្ញើការជូនដំណឹងពេលបន្ទាន់ទៅអ្នកថែទាំ និងវេជ្ជបណ្ឌិតដែលភ្ជាប់ទាំងអស់។ តើអ្នកប្រាកដទេ?

source: Emergency Alert Sent
km: បានផ្ញើការជូនដំណឹងពេលបន្ទាន់

# caregiversNotified
source: All connected caregivers and doctors have been notified.
km: អ្នកថែទាំ និងវេជ្ជបណ្ឌិតដែលភ្ជាប់ទាំងអស់ត្រូវបានជូនដំណឹង។

source: Emergency Alert
km: ការជូនដំណឹងពេលបន្ទាន់

# emergencyAlertDescription
source: Tap the button below to alert all your connected caregivers and doctors.
km: ចុចប៊ូតុងខាងក្រោមដើម្បីជូនដំណឹងអ្នកថែទាំ និងវេជ្ជបណ្ឌិតដែលភ្ជាប់ទាំងអស់។

source: Message (optional)
km: សារ (ស្រេចចិត្ត)

# describeSituation
source: Describe your situation...
km: ពិពណ៌នាស្ថានភាពរបស់អ្នក...

source: Emergency alert triggered
km: បានបញ្ជូនការជូនដំណឹងពេលបន្ទាន់

# doctorPatientsTab
source: Patients
km: អ្នកជំងឺ

# doctorPrescriptionsTab
source: Prescriptions
km: វេជ្ជបញ្ជា

# doctorPrescriptionHistoryTab
source: History
km: ប្រវត្តិ

source: Good Morning
km: អរុណសួស្តី

source: Good Afternoon
km: ទិវាសួស្តី

source: Good Evening
km: សាយណសួស្តី

source: Total Patients
km: អ្នកជំងឺសរុប

source: Need Attention
km: ត្រូវការការយកចិត្តទុកដាក់

source: Pending Requests
km: សំណើរង់ចាំ

source: Today Alerts
km: ការជូនដំណឹងថ្ងៃនេះ

source: Critical Alerts
km: ការជូនដំណឹងសំខាន់

# consecutiveMissedDoses
source: {count} consecutive missed doses
km: ខកខានទទួលទានថ្នាំ {count} ដងជាប់គ្នា

source: Pending Connection Requests
km: សំណើតភ្ជាប់រង់ចាំ

source: Connection request
km: សំណើតភ្ជាប់

source: New Prescription
km: វេជ្ជបញ្ជាថ្មី

source: Find Patient
km: ស្វែងរកអ្នកជំងឺ

source: My Patients
km: អ្នកជំងឺរបស់ខ្ញុំ

source: Search patients...
km: ស្វែងរកអ្នកជំងឺ...

# adherenceGood
source: Good
km: ល្អ

# adherenceModerate
source: Moderate
km: មធ្យម

# adherencePoor
source: Poor
km: ខ្សោយ

source: No patients found
km: រកមិនឃើញអ្នកជំងឺ

# tryDifferentSearch
source: Try a different search.
km: សាកស្វែងរកពាក្យផ្សេង។

# connectedPatientsAppearHere
source: Connected patients will appear here.
km: អ្នកជំងឺដែលភ្ជាប់នឹងបង្ហាញនៅទីនេះ។

source: Prescriptions
km: វេជ្ជបញ្ជា

source: No prescriptions
km: គ្មានវេជ្ជបញ្ជា

source: Create Prescription
km: បង្កើតវេជ្ជបញ្ជា

source: Prescription History
km: ប្រវត្តិវេជ្ជបញ្ជា

source: No prescription history
km: គ្មានប្រវត្តិវេជ្ជបញ្ជា

# prescriptionsCreatedAppearHere
source: Your created prescriptions will appear here.
km: វេជ្ជបញ្ជាដែលអ្នកបានបង្កើត នឹងបង្ហាញនៅទីនេះ។

source: Overview
km: ទិដ្ឋភាពទូទៅ

source: Adherence
km: ការប្រតិបត្តិតាម

source: Vitals
km: សញ្ញាសុខភាព

source: Notes
km: កំណត់ចំណាំ

source: Failed to load patient details
km: បរាជ័យក្នុងការផ្ទុកព័ត៌មានអ្នកជំងឺ

# ageLabel
source: Age: {age} · {gender}
km: អាយុ: {age} · {gender}

source: Late
km: យឺត

source: Active Prescriptions ({count})
km: វេជ្ជបញ្ជាសកម្ម ({count})

source: Prescription
km: វេជ្ជបញ្ជា

# statusMedicines
source: {status} · {count} medicines
km: {status} · ថ្នាំ {count} មុខ

# noAdherenceData
source: No adherence data available
km: គ្មានទិន្នន័យការប្រតិបត្តិតាម

# dailyAdherenceLast30
source: Daily Adherence (Last 30 Days)
km: ការប្រតិបត្តិតាមប្រចាំថ្ងៃ (៣០ ថ្ងៃចុងក្រោយ)

source: Daily Breakdown
km: ការវិភាគប្រចាំថ្ងៃ
